Reports/ОтчетПоИзменениямВЗакрытомПериоде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ОтчетПоИзменениямВЗакрытомПериоде</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РазделыДатЗапретаИзменения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНазначенияДатЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыНазначенияДатЗапрета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДляВсехПользователей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсемПользователям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсемОбъектам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтчетПоИзменениямВЗакрытомПериоде/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ВыбраннаяДатаЗапрета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата").Значение;
	Если ЗначениеЗаполнено(ВыбраннаяДатаЗапрета) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ	
		               |	ДатыЗапретаИзменения.ДатаЗапрета КАК ГлобальнаяДатаЗапрета
		               |ИЗ
		               |	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		               |ГДЕ
		               |	ДатыЗапретаИзменения.Объект = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ПоВсемОбъектам)
		               |	И ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ПоВсемПользователям)";
		МассивДат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГлобальнаяДатаЗапрета");
		 
		//Установим границы периода отчета. КонечнаяДата - выбранная дата в параметрах, НачальнаяДата - предыдущая дата запрета редактирования до выбранной
		ПредыдущаяДатаЗапрета = '00010101';
		Если МассивДат.Количество() > 0 Тогда 
			Для Ы = 1 По МассивДат.Количество() - 1 Цикл
				Если МассивДат[Ы] = ВыбраннаяДатаЗапрета Тогда
					ПредыдущаяДатаЗапрета = МассивДат[Ы-1];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе //за все время
		ПредыдущаяДатаЗапрета = '00010101';
		ВыбраннаяДатаЗапрета  = КонецГода(ТекущаяДата());
	КонецЕсли;
	 
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрСКД.Значение = новый  СтандартныйПериод(ПредыдущаяДатаЗапрета, ВыбраннаяДатаЗапрета);
	ПараметрСКД.Использование = Истина;
	 
КонецПроцедуры
